; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=66, out_folder=htg/blocksworld//training, instance_id=46, seed=2070

(define (problem blocksworld-46)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 - object)
 (:init 
    (arm-empty)
    (clear b18)
    (on b18 b59)
    (on b59 b17)
    (on b17 b46)
    (on b46 b15)
    (on b15 b30)
    (on b30 b38)
    (on b38 b54)
    (on b54 b36)
    (on b36 b49)
    (on b49 b40)
    (on b40 b65)
    (on b65 b47)
    (on b47 b45)
    (on b45 b9)
    (on b9 b48)
    (on b48 b22)
    (on b22 b1)
    (on b1 b31)
    (on-table b31)
    (clear b62)
    (on b62 b7)
    (on b7 b39)
    (on-table b39)
    (clear b14)
    (on-table b14)
    (clear b12)
    (on b12 b61)
    (on-table b61)
    (clear b35)
    (on b35 b4)
    (on b4 b64)
    (on b64 b27)
    (on b27 b43)
    (on b43 b23)
    (on b23 b26)
    (on b26 b25)
    (on b25 b16)
    (on b16 b32)
    (on b32 b20)
    (on b20 b52)
    (on b52 b24)
    (on b24 b37)
    (on b37 b42)
    (on b42 b2)
    (on b2 b19)
    (on b19 b29)
    (on b29 b44)
    (on b44 b58)
    (on-table b58)
    (clear b57)
    (on b57 b28)
    (on b28 b34)
    (on b34 b53)
    (on b53 b55)
    (on b55 b8)
    (on b8 b3)
    (on b3 b56)
    (on b56 b51)
    (on b51 b11)
    (on b11 b5)
    (on b5 b60)
    (on b60 b63)
    (on b63 b41)
    (on b41 b33)
    (on b33 b21)
    (on b21 b66)
    (on b66 b6)
    (on b6 b10)
    (on b10 b13)
    (on b13 b50)
    (on-table b50))
 (:goal  (and 
    (clear b6)
    (on b6 b5)
    (on b5 b1)
    (on b1 b4)
    (on b4 b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b57 b28)
   deleted: (on b57 b28) (clear b57) (arm-empty)
   added: (holding b57) (clear b28)
   goals met: 0 of 7
2. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 0 of 7
3. (unstack b28 b34)
   deleted: (on b28 b34) (clear b28) (arm-empty)
   added: (holding b28) (clear b34)
   goals met: 0 of 7
4. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 0 of 7
5. (unstack b18 b59)
   deleted: (on b18 b59) (clear b18) (arm-empty)
   added: (holding b18) (clear b59)
   goals met: 0 of 7
6. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 7
7. (unstack b59 b17)
   deleted: (on b59 b17) (clear b59) (arm-empty)
   added: (holding b59) (clear b17)
   goals met: 0 of 7
8. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 0 of 7
9. (unstack b17 b46)
   deleted: (on b17 b46) (clear b17) (arm-empty)
   added: (holding b17) (clear b46)
   goals met: 0 of 7
10. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 7
11. (unstack b34 b53)
   deleted: (on b34 b53) (clear b34) (arm-empty)
   added: (holding b34) (clear b53)
   goals met: 0 of 7
12. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 0 of 7
13. (unstack b53 b55)
   deleted: (on b53 b55) (clear b53) (arm-empty)
   added: (holding b53) (clear b55)
   goals met: 0 of 7
14. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 0 of 7
15. (unstack b55 b8)
   deleted: (on b55 b8) (clear b55) (arm-empty)
   added: (holding b55) (clear b8)
   goals met: 0 of 7
16. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 0 of 7
17. (unstack b8 b3)
   deleted: (on b8 b3) (clear b8) (arm-empty)
   added: (holding b8) (clear b3)
   goals met: 0 of 7
18. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 7
19. (unstack b3 b56)
   deleted: (on b3 b56) (clear b3) (arm-empty)
   added: (holding b3) (clear b56)
   goals met: 0 of 7
20. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 7
21. (unstack b46 b15)
   deleted: (on b46 b15) (clear b46) (arm-empty)
   added: (holding b46) (clear b15)
   goals met: 1 of 7
22. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 1 of 7
23. (unstack b15 b30)
   deleted: (on b15 b30) (clear b15) (arm-empty)
   added: (holding b15) (clear b30)
   goals met: 1 of 7
24. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 7
25. (unstack b30 b38)
   deleted: (on b30 b38) (clear b30) (arm-empty)
   added: (holding b30) (clear b38)
   goals met: 1 of 7
26. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 1 of 7
27. (unstack b38 b54)
   deleted: (on b38 b54) (clear b38) (arm-empty)
   added: (holding b38) (clear b54)
   goals met: 1 of 7
28. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 1 of 7
29. (unstack b35 b4)
   deleted: (on b35 b4) (clear b35) (arm-empty)
   added: (holding b35) (clear b4)
   goals met: 1 of 7
30. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 1 of 7
31. (unstack b54 b36)
   deleted: (on b54 b36) (clear b54) (arm-empty)
   added: (holding b54) (clear b36)
   goals met: 1 of 7
32. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 1 of 7
33. (unstack b36 b49)
   deleted: (on b36 b49) (clear b36) (arm-empty)
   added: (holding b36) (clear b49)
   goals met: 1 of 7
34. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 1 of 7
35. (unstack b49 b40)
   deleted: (on b49 b40) (clear b49) (arm-empty)
   added: (holding b49) (clear b40)
   goals met: 1 of 7
36. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 1 of 7
37. (unstack b40 b65)
   deleted: (on b40 b65) (clear b40) (arm-empty)
   added: (holding b40) (clear b65)
   goals met: 1 of 7
38. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 1 of 7
39. (unstack b65 b47)
   deleted: (on b65 b47) (clear b65) (arm-empty)
   added: (holding b65) (clear b47)
   goals met: 1 of 7
40. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 1 of 7
41. (unstack b47 b45)
   deleted: (on b47 b45) (clear b47) (arm-empty)
   added: (holding b47) (clear b45)
   goals met: 1 of 7
42. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 1 of 7
43. (unstack b45 b9)
   deleted: (on b45 b9) (clear b45) (arm-empty)
   added: (holding b45) (clear b9)
   goals met: 1 of 7
44. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 1 of 7
45. (unstack b9 b48)
   deleted: (on b9 b48) (clear b9) (arm-empty)
   added: (holding b9) (clear b48)
   goals met: 1 of 7
46. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 7
47. (unstack b48 b22)
   deleted: (on b48 b22) (clear b48) (arm-empty)
   added: (holding b48) (clear b22)
   goals met: 1 of 7
48. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 1 of 7
49. (unstack b22 b1)
   deleted: (on b22 b1) (clear b22) (arm-empty)
   added: (holding b22) (clear b1)
   goals met: 1 of 7
50. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 1 of 7
51. (unstack b1 b31)
   deleted: (on b1 b31) (clear b1) (arm-empty)
   added: (holding b1) (clear b31)
   goals met: 1 of 7
52. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 2 of 7
53. (unstack b56 b51)
   deleted: (on b56 b51) (clear b56) (arm-empty)
   added: (holding b56) (clear b51)
   goals met: 2 of 7
54. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 2 of 7
55. (unstack b51 b11)
   deleted: (on b51 b11) (clear b51) (arm-empty)
   added: (holding b51) (clear b11)
   goals met: 2 of 7
56. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 2 of 7
57. (unstack b11 b5)
   deleted: (on b11 b5) (clear b11) (arm-empty)
   added: (holding b11) (clear b5)
   goals met: 2 of 7
58. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 7
59. (unstack b5 b60)
   deleted: (on b5 b60) (clear b5) (arm-empty)
   added: (holding b5) (clear b60)
   goals met: 2 of 7
60. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 7
61. (unstack b60 b63)
   deleted: (on b60 b63) (clear b60) (arm-empty)
   added: (holding b60) (clear b63)
   goals met: 2 of 7
62. (stack b60 b1)
   deleted: (clear b1) (holding b60)
   added: (arm-empty) (clear b60) (on b60 b1)
   goals met: 2 of 7
63. (unstack b63 b41)
   deleted: (on b63 b41) (clear b63) (arm-empty)
   added: (holding b63) (clear b41)
   goals met: 2 of 7
64. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 2 of 7
65. (unstack b41 b33)
   deleted: (on b41 b33) (clear b41) (arm-empty)
   added: (holding b41) (clear b33)
   goals met: 2 of 7
66. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 2 of 7
67. (unstack b33 b21)
   deleted: (on b33 b21) (clear b33) (arm-empty)
   added: (holding b33) (clear b21)
   goals met: 2 of 7
68. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 2 of 7
69. (unstack b21 b66)
   deleted: (on b21 b66) (clear b21) (arm-empty)
   added: (holding b21) (clear b66)
   goals met: 2 of 7
70. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 2 of 7
71. (unstack b66 b6)
   deleted: (on b66 b6) (clear b66) (arm-empty)
   added: (holding b66) (clear b6)
   goals met: 3 of 7
72. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 3 of 7
73. (unstack b6 b10)
   deleted: (on b6 b10) (clear b6) (arm-empty)
   added: (holding b6) (clear b10)
   goals met: 2 of 7
74. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 4 of 7
75. (unstack b60 b1)
   deleted: (on b60 b1) (clear b60) (arm-empty)
   added: (holding b60) (clear b1)
   goals met: 4 of 7
76. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 4 of 7
77. (unstack b1 b4)
   deleted: (on b1 b4) (clear b1) (arm-empty)
   added: (holding b1) (clear b4)
   goals met: 3 of 7
78. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 7
79. (unstack b4 b64)
   deleted: (on b4 b64) (clear b4) (arm-empty)
   added: (holding b4) (clear b64)
   goals met: 3 of 7
80. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 3 of 7
81. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 3 of 7
82. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 4 of 7
83. (unstack b64 b27)
   deleted: (on b64 b27) (clear b64) (arm-empty)
   added: (holding b64) (clear b27)
   goals met: 4 of 7
84. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 4 of 7
85. (unstack b27 b43)
   deleted: (on b27 b43) (clear b27) (arm-empty)
   added: (holding b27) (clear b43)
   goals met: 4 of 7
86. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 4 of 7
87. (unstack b43 b23)
   deleted: (on b43 b23) (clear b43) (arm-empty)
   added: (holding b43) (clear b23)
   goals met: 4 of 7
88. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 4 of 7
89. (unstack b23 b26)
   deleted: (on b23 b26) (clear b23) (arm-empty)
   added: (holding b23) (clear b26)
   goals met: 4 of 7
90. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 4 of 7
91. (unstack b26 b25)
   deleted: (on b26 b25) (clear b26) (arm-empty)
   added: (holding b26) (clear b25)
   goals met: 4 of 7
92. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 4 of 7
93. (unstack b25 b16)
   deleted: (on b25 b16) (clear b25) (arm-empty)
   added: (holding b25) (clear b16)
   goals met: 4 of 7
94. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 4 of 7
95. (unstack b16 b32)
   deleted: (on b16 b32) (clear b16) (arm-empty)
   added: (holding b16) (clear b32)
   goals met: 4 of 7
96. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 4 of 7
97. (unstack b32 b20)
   deleted: (on b32 b20) (clear b32) (arm-empty)
   added: (holding b32) (clear b20)
   goals met: 4 of 7
98. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 4 of 7
99. (unstack b20 b52)
   deleted: (on b20 b52) (clear b20) (arm-empty)
   added: (holding b20) (clear b52)
   goals met: 4 of 7
100. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 4 of 7
101. (unstack b52 b24)
   deleted: (on b52 b24) (clear b52) (arm-empty)
   added: (holding b52) (clear b24)
   goals met: 4 of 7
102. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 4 of 7
103. (unstack b24 b37)
   deleted: (on b24 b37) (clear b24) (arm-empty)
   added: (holding b24) (clear b37)
   goals met: 4 of 7
104. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 4 of 7
105. (unstack b37 b42)
   deleted: (on b37 b42) (clear b37) (arm-empty)
   added: (holding b37) (clear b42)
   goals met: 4 of 7
106. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 4 of 7
107. (unstack b42 b2)
   deleted: (on b42 b2) (clear b42) (arm-empty)
   added: (holding b42) (clear b2)
   goals met: 4 of 7
108. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 4 of 7
109. (unstack b2 b19)
   deleted: (on b2 b19) (clear b2) (arm-empty)
   added: (holding b2) (clear b19)
   goals met: 4 of 7
110. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 5 of 7
111. (unstack b1 b4)
   deleted: (on b1 b4) (clear b1) (arm-empty)
   added: (holding b1) (clear b4)
   goals met: 4 of 7
112. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 4 of 7
113. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 4 of 7
114. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 5 of 7
115. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 7
116. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 6 of 7
117. (unstack b6 b5)
   deleted: (on b6 b5) (clear b6) (arm-empty)
   added: (holding b6) (clear b5)
   goals met: 4 of 7
118. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 5 of 7
119. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 5 of 7
120. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 6 of 7
121. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 5 of 7
122. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 7 of 7
